{
  "company": {
    "id": "35513374",
    "universalName": "monogram-health",
    "name": "Monogram Health",
    "website": "https://www.monogramhealth.com",
    "linkedinUrl": "https://www.linkedin.com/company/monogram-health/",
    "foundedOn": {
      "month": null,
      "year": 2019,
      "day": null
    },
    "employeeCount": 775,
    "employeeCountRange": {
      "start": 1001,
      "end": 5000
    },
    "followerCount": 20312,
    "description": "Monogram Health is a leading multispecialty provider of in-home, evidence-based care for the most complex of patients who have multiple chronic conditions. Monogram health takes a comprehensive and personalized approach to a person’s health, treating not only a disease, but all of the chronic conditions that are present - such as diabetes, hypertension, chronic kidney disease, heart failure, depression, COPD, and other metabolic disorders. \n\nMonogram Health employs a robust clinical team, leveraging specialists across multiple disciplines including nephrology, cardiology, endocrinology, pulmonology, behavioral health, and palliative care to diagnose and treat health issues; review and prescribe medication; provide guidance, education, and counselling on a patient’s healthcare options; as well as assist with daily needs such as access to food, eating healthy, transportation, financial assistance, and more. Monogram Health is available 24 hours a day, 7 days a week, and on holidays, to support and treat patients in their home.\n\nMonogram Health’s personalized and innovative treatment model is proven to dramatically improve patient outcomes and quality of life while reducing medical costs across the health care continuum. Based in Nashville, Tennessee, Monogram Health operates in 37 states and is privately held by Frist Cressey Ventures, Norwest Venture Partners, TPG Capital, and other leading strategic and financial investors.",
    "industries": [
      {
        "id": "14",
        "name": "Hospital & Health Care",
        "urn": "urn:li:fsd_industry:14"
      }
    ],
    "specialities": [
      "Medicare Advantage",
      "Value Based Health",
      "In-home Care",
      "Pulmonology",
      "Cardiology ",
      "Palliative Care",
      "End of Life Care",
      "Endocrinology",
      "Pharmacists",
      "Multispecialty Provider",
      "Nephrology",
      "Social Determinants of Health",
      "Behavioral Health",
      "Social Work",
      "Actuarial Intelligence",
      "Clinical Outcomes",
      "24/7 Health Line"
    ],
    "headquarter": {},
    "funding": null,
    "pageVerified": true
  },
  "posts_analysis": {
    "Partnership": [
      {
        "id": "7373388897784872961",
        "content": "Have you ever felt like the healthcare system does not fully see you? Today, according to the CDC, more than 78% of U.S. adults (age 65+) endure two or more chronic conditions, and that number is growing. \n\nThat’s where Monogram Health can help. Monogram deploys a robust team of specialists across multiple disciplines including nephrology, cardiology, endocrinology, pulmonology, behavioral health, and palliative care to holistically treat a patient’s complex conditions. Monogram can serve as, or work with, existing primary care physicians to dramatically improve a patient’s health outcomes and quality of life. \n\nWe do this by treating all of a patient’s conditions – from heart failure, to diabetes, COPD, renal care, and more – our patients can depend on Monogram Health. \n\nTo learn more abo",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7351290504682110976",
        "content": "Monogram Health is thrilled to announce our partnership with Aetna, a CVS Health Company has expanded to Florida. Now, all eligible Aetna Medicare Advantage members across the state, who meet the program’s criteria, will benefit from Monogram’s value-based, in-home, multispecialty care for patients suffering from polychronic disease. \n \nLike many states, Florida faces a shortage of healthcare professionals, rising healthcare costs, and the need to expand interventional services. Monogram Health has a proven track record for driving positive clinical outcomes, decreasing hospital and ER admission rates, and increasing star ratings, resulting in reduced medical costs and a high quality of living for all engaged patients. \n \nTo date, the CDC reports that kidney disease, heart disease, diabete",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7333514932560281600",
        "content": "As a value-based, multispecialty provider of in-home evidence-based care, #MonogramHealth is on a mission to improve patient outcomes across 36 states. Closing out May, members of the Monogram Health leadership team visited several state markets across Florida and the Mid-Atlantic to host clinical discussions on COPD and heart failure management as well as best practices for facilitating home transitions and palliative/hospice care. \n\nCollaboration in healthcare is critical and our eastern region colleagues, who are responsible for 84,000 patients, are leading the way in delivering multispecialty care for those polychronic patients with cardio-metabolic, kidney, and pulmonary conditions. \n\n#Multispeciality #PolychronicCare #PatientCentric #Collaboration",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7302699230337396736",
        "content": "We’re excited to announce the launch of our first population initiative under our joint venture with Memorial Hermann Health System. Starting this year, patients with chronic and end-stage kidney disease covered by Memorial Hermann Health Plan will gain access to Monogram Health’s high-quality, multispecialty in-home care.\n\nThis collaboration combines Monogram’s expertise in in-home care with Memorial Hermann’s extensive care network, improving outcomes for patients in the Houston area with complex chronic conditions.\n\nRead more about this initiative: https://lnkd.in/eP6v3CGF\n\n#Healthcare #AccessToCare #ChronicDisease #ValueBasedCare",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7287461458387300353",
        "content": "We’re excited to announce our value-based care collaboration with Aetna, a CVS Health Company, is expanding into Texas. Now eligible Aetna Medicare Advantage members across the state will be able to benefit from our comprehensive, home-based care for chronic and end-stage kidney disease. This is especially important in a state like Texas, which has the fourth highest rate of kidney disease in the country and the largest percentage of dialysis patients in the entire U.S.\n\nSince Monogram Health started in 2019, we’ve steadily increased the number of patients we reach, and this announcement marks another milestone. We now cover over 200,000 patients across 36 states and look forward to improving outcomes for more Americans in the months and years to come.\n\n#ValueBasedCare #AccessToCare #Chron",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7285653279387066368",
        "content": "Monogram CEO Mike Uchrin and CFO Bhavesh Shah represented our team at #JPM2025 in San Francisco this week, highlighting Monogram’s innovative in-home, multispecialty provider risk platform. They shared insights into our proven success in delivering cost savings and improved outcomes for patients with chronic kidney disease and related conditions.\n\nDuring the conference, Mike and Bhavesh engaged in meaningful discussions with industry leaders and partners, exploring how to advance value-based care models and transform care delivery for patients with complex chronic conditions. Their meetings emphasized the importance of collaboration and innovation in driving sustainable change in healthcare.\n\nWe’re proud to have participated in this important event and are inspired by the conversations and",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7275926645192966144",
        "content": "We’re proud to highlight Monogram Health’s Vice President of Provider Partnerships, James Porter, and his impactful journey featured by LHC.\n\nFrom creating innovative programs to driving better care for complex patient populations, James brings unparalleled expertise and passion to Monogram. His commitment to building solutions from the ground up has shaped his career and continues to transform healthcare.\n\nDiscover how James leverages Nashville's vibrant healthcare community to foster collaboration and innovation on the LHC blog.",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7272981047309385728",
        "content": "Leading payers and providers partner with Monogram because we’re the only national provider with a multispecialty platform capable of delivering precise, consistent care for our patients’ most complex health conditions.\n\nWith specialist-informed protocols and tailored order sets, our Nurse Practitioners address conditions like diabetes and hypertension in kidney disease patients’ homes, using a comprehensive approach to improve outcomes nationwide.\n\n#Healthcare #Partnership #ValueBasedCare",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7260282347378425857",
        "content": "Monogram Health is proud to announce the expansion of our collaboration with Aetna, a CVS Health Company into Pennsylvania for eligible Medicare Advantage members, furthering our mission to provide comprehensive, home-based multispecialty care for people living with chronic kidney and end-stage kidney disease.\n\nOur care model goes beyond traditional treatment by focusing on the whole patient, integrating care for all polychronic conditions that are present and addressing social determinants of health such as transportation and housing. With in-home assessments and dedicated monitoring, we reduce barriers and deliver truly patient-centered care.",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7251989209698246658",
        "content": "After sharing from the stage at last week's Nashville Health Care Council #Sessions2024, our CEO Mike Uchrin joined the VIP Access discussions to highlight the biggest opportunities for integration and collaboration across the industry.\n\n#CKD #ESKD #KidneyHealth #ValueBasedCare #EvidenceBasedCare #InHomeCare #PrimaryCare #SpecialtyCare #PolychronicCare #PolychronicConditions #Polychronic",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7245455958095654912",
        "content": "Yesterday at CAQH Connect 2024, #MonogramHealth Chief Clinical Officer Amal Agarwal, DO MBA delved into the dynamic landscape of value-based care during a rich panel discussion with Centers for Medicare & Medicaid Services (CMS) Innovation Center Deputy Director of the Business Services Group Todd Couts and Providence Vice President of Data Partnerships and Informatics Michael Westover. Attendees gleaned valuable insights and actionable strategies for navigating the evolution, merits, and complexities of #VBC.\n\n#CKD #ESKD #KidneyHealth #ValueBasedCare #EvidenceBasedCare #InHomeCare #PrimaryCare #SpecialtyCare #PolychronicCare #PolychronicConditions #Polychronic",
        "date": null,
        "author": "Monogram Health"
      }
    ],
    "Recognition": [
      {
        "id": "7371925230241415168",
        "content": "Nashville Business Journal recently announced its 2025 C-Suite Awards honorees. Our Chief Human Resources Officer, Greg Hicks, was selected for this distinguished list of C-level executives who are innovators, motivators, and decision-makers inside Nashville’s top companies. \n\nThank you, Greg, for your concerted efforts in making Monogram Health an employer of choice both inside and outside of Nashville and for remaining true to our mission to revolutionize the delivery of care for patients with multiple chronic conditions. \n\nFor the full list of honorees, see below: https://lnkd.in/g25z4uRZ",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7336025207830159360",
        "content": "We are excited to share Monogram Health has been selected as an honoree for Nashville Business Journal's \"2025 Fastest-Growing Companies Awards.\" This distinguished list evaluates and recognizes the 25 fastest-growing private companies in Middle Tennessee based on employee counts, revenue numbers, and more. \n\nhttps://lnkd.in/e_EiAsCA\n\nStay tuned - the full list (with rankings) will be revealed on August 12! #NBJFGC",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7252671108242374656",
        "content": "Always delighted to see our portfolio companies recognized in trade publications. This year’s Inc 5000 list has identified the fastest growing private companies in America, and the 2024 cohort includes companies such as Monogram Health and Workit Health. We’re proud to support these companies along their growth journey. To learn more about the Inc 5000 list, read here: https://lnkd.in/g6Yn3rnH",
        "date": null,
        "author": "CVS Health Ventures"
      }
    ],
    "Other": [
      {
        "id": "7368281513546752001",
        "content": "We are incredibly proud of our dedicated teams that work diligently to transform the way healthcare is delivered for those suffering from polychronic disease so they can lead healthier, happier, and more fulfilling lives. \n\nOur Monogram colleagues begin and end each day putting our patients’ needs first and working thoughtfully and tirelessly to treat and care for a patient’s whole health. We wish our entire Monogram Family a Happy Labor Day – we are grateful for the work you do and the positive impact you have on our 200,000+ patients’ lives.",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7366848772351356930",
        "content": "Social determinants of health have a significant impact on a person’s well-being and quality of life, and they play a crucial role in a person’s overall health, particularly as they age. If left unresolved, these social barriers to health (i.e., lack of transportation, access to food, financial insecurity, gaps in education, and inadequate support systems) can lead to negative patient outcomes. \n\nLike many Americans, Dennis Eleuteri is living with several chronic conditions that affect his day-to-day living. In addition to his medical needs, his many social needs prohibit Dennis from living a better life. Watch where Monogram Health can and does step in to treat and care for a person’s whole health. \n\n#SocialNeeds #SocialDeterminantsOfHealth #SDoH #Illiteracy #PersonalizedTreatment #Coordi",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7364283891618070528",
        "content": "On the heels of our 2025 Inc. 5000 ranking, we are thrilled to announce the Nashville Business Journal recently ranked Monogram Health as The Fastest Growing Company in 2025.  \n \nWe are proud to be a part of the booming Nashville healthcare and business community as we continue to treat patients with multiple chronic conditions, in their homes, across middle Tennessee.  \n \nOur patients, partners, and colleagues can all attest to Monogram’s innovative and personalized approach in revolutionizing the delivery of care for polychronic patients. Our programs and robust multi-Specialty clinical teams are in more need today than ever before.  \n \nThank you to our patients and partners for trusting us with your health! \n \nFull press release here: https://lnkd.in/ekt9Sm3w",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7360992202916864000",
        "content": "We are excited to announce that Monogram Health has made the 2025 #Inc5000 list at #7. This is the second consecutive year the company has made the top of the list, as we ranked No. 3 in 2024. \n \nIn addition to being listed as the 7th Fastest Growing Company in the United States, Monogram Health was also listed as the No. 2 fastest growing company across the healthcare industry and the No. 1 fastest-growing company in the state of Tennessee.   \n \nAs Monogram Health continues its work to revolutionize the way care is delivered to polychronic patients throughout the United States, we are proud of the profound impact our unique, personalized, in-home, multispecialty approach has already had on our patients, providers, and payer networks alike.  \n \nWe look forward to continuing this momentum t",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7353155125831442434",
        "content": "Care isn’t always financially accessible – especially for patients like Wanda, who are living with a chronic condition and facing high prescription costs. \n\nWhen Wanda struggled to afford her medication, she called Monogram Health FIRST and a Monogram Health social worker collaborated with a Monogram Health pharmacist to find an alternative medication for her condition as well as a coupon to reduce the price of that new medication. \n\nMonogram’s model is designed to meet people where they are – and in this case, it’s ensuring Wanda has access to the COPD medication she needed. Improving health outcomes starts with understanding the real challenges patients face every day. \n\n#PatientFirst #ClosingGapsInCare #ChronicDisease #COPD #AffordableMedication #MonogramHealthFIRST",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7353122043208376321",
        "content": "A recent article in Forbes by Bill Frist, M.D. highlights the inequities that rural populations face as it pertains to healthcare, notably: access, specialization, proactive and consistent engagement, as well as personalized solutions tailored to each community. \n\nPart 1 of the series 'Rural Health Resilience' states, “older adults are often managing multiple chronic illnesses without access to home-based care, nearby pharmacies, or geriatric specialists…”\n\nAt Monogram Health, we are proud to be part of the solution in serving rural communities and delivering personalized, multispecialty treatment and care directly in their homes. \n\nhttps://lnkd.in/eQw6W9rg \n#MultispecialtyCare #RuralAmerica #RuralInHomeCare #RuralHealthcareCrisis",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7349105129968549888",
        "content": "Emergency departments are overburdened — and patients and payers are bearing the cost. \n \nToo often, unmanaged chronic conditions lead to avoidable ER visits that strain both the system and the patient’s wallet. \n\nMonogram’s in-home, multispecialty care identifies risks early and treats patients with 24/7 coordinated, in-home, longitudinal care. \n\nAs a result, Monogram Health has reduced ER admissions by 50%, which is better for everyone – patients and health plans alike.\n \n#ChronicDisease #Utilization #PatientOutcomes",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7346900598996295684",
        "content": "This 4th of July, we are incredibly thankful for the dedicated service members who protect our country, for our freedoms and liberties, and for the pursuit of happiness. Here at Monogram Health, the pursuit of happiness begins and ends with our patients as we remain steadfast in transforming the way health care is delivered for those with polychronic disease so they can lead healthier, happier, and more fulfilling lives.\n\n#Blessed #USA #PursuitOfHappiness",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7338247028751130624",
        "content": "Numerous U.S. adults are facing a heavy burden of living with at least one chronic condition – and for many, those conditions are poorly managed until they reach a crisis point. \n\nCare that connects the dots can make a huge difference – listen to Dolores and Roland’s story below. \n \nMonogram’s in-home care model brings together primary, specialty and pharmacy treatment to help patients manage multiple conditions, with fewer barriers, and better outcomes.\n \n#ValueBasedCare #InHomeCare #Diagnosis&Treatment #MultiSpecialty",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7325981009542275074",
        "content": "May is National Nurses Month, and we want to recognize Monogram Health’s 300+ nurses across 36 states who care for the 200,000 patients that Monogram Health serves. \n\nAs our nursing teams continue to expand and grow across the United States, we are excited for more communities to bear witness to the “Power of Monogram Health Nurses” and the positive clinical outcomes achieved as a result of their concerted efforts.\n\nTo date, our value-based, multispecialty, in-home care model has proven successful, as we have seen a 44% reduction in hospital admissions, 52% fewer ER admissions, and our star ratings have increased to well over 4 stars. These results are a true testament to the skills and dedication that our nurses bring to the job every day.\n\n#NationalNursesMonth #NationalNursesWeek #PowerO",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7320459540594843648",
        "content": "Did you know that a majority of patients begin dialysis in an unplanned, emergency setting known as \"crashing into dialysis?\" These sudden starts often result in higher healthcare costs, worse outcomes, and a significantly lower quality of life for patients. \n\nBacked by medical economics analysis and a multi-specialty set of capabilities, Monogram Health is changing that narrative with a proactive, patient-centered approach known as “optimized start.” An effective optimized dialysis start entails highly systematized clinical workflows with discrete, trackable steps that ensure timely interventions that minimize complications, reduce unnecessary hospitalizations, lower costs, and improve patient outcomes. \n\nBy focusing on early, evidence-based care, Monogram Health has supported 63% patient",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7313948849331392514",
        "content": "We're here at the Renal Physicians Association 2025 Annual Meeting in Las Vegas (Booth #402)!\n\nExcited to connect with nephrologists and share how Monogram Health’s in-home, value-based, multi-specialty care model fills healthcare gaps between providers and patients. \n\n#RPACommunity #Nephrology #ValueBasedCare #PatientOutcomes",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7312100046957662208",
        "content": "Today, on National Doctors' Day, we celebrate the dedication and commitment of physicians everywhere.\n\nAt Monogram Health, we’re especially grateful for the doctors within our organization and those we partner with who work tirelessly to transform care for individuals with chronic conditions. Your commitment to delivering high-quality, personalized care to those who need it most makes a difference every day. \n\nThank you for what you do! \n\n#NationalDoctorsDay #DoctorsDay2025",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7307781937631318016",
        "content": "Prioritizing Quality of Life: Monogram Health’s Palliative Care Approach\n\nPalliative care isn’t just about end-of-life support—it’s about improving the quality of life for patients facing serious, chronic conditions. At Monogram Health, we integrate palliative care into our multispecialty, in-home model to provide comprehensive, compassionate support for patients and their families.\n\nOur Nurse Practitioners and specialists work together to manage symptoms, address emotional and social needs, and ensure each patient’s care aligns with their values and goals. By bringing palliative care into the home, we help patients like Ms. Cathy live more comfortably, with dignity and personalized care that truly makes a difference.\n\nWatch Ms. Cathy’s story to see how Monogram’s palliative care approach ",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7305943291584278530",
        "content": "Today is World Kidney Day, a global reminder of the vital role our kidneys play in overall health—and the urgent need to address the rising impact of chronic kidney disease (CKD).\n\nAt Monogram Health, we’re leading the way in transforming how kidney care is delivered. Unlike traditional models that focus on late-stage interventions, Monogram takes a proactive, in-home, multispecialty approach that treats both kidney disease and the chronic conditions that drive it, such as heart failure, diabetes, and hypertension.\n\nCKD often goes undetected until it’s advanced, but our comprehensive care model identifies and addresses issues earlier, helping patients avoid hospitalizations and slow disease progression. For the 200,000 patients we’ll serve this year, Monogram’s personalized, evidence-based",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7303786204938862592",
        "content": "At Monogram Health, our “why” is simple: to provide life-changing treatment and care for our patients that addresses the complex needs that come with chronic conditions. This mission is only possible because of our incredible team. Every day, they bring passion, dedication and expertise to improve the lives of those we serve.\n\nIn honor of Employee Appreciation Day, we are highlighting some of the dedicated team members who make up Monogram. Their stories inspire us, and their commitment drives our impact.\n\nTo every team member – whether you’re working directly with patients, supporting operations or driving innovation behind the scenes – you are the heart of Monogram Health. Thank you for all that you do! \n\n#EmployeeAppreciationDay #TeamMonogram",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7303443080928477185",
        "content": "March is National Kidney Month, and at Monogram Health, we’re transforming how kidney care is delivered to those who need it most. Chronic kidney disease (CKD) often goes undiagnosed until it reaches advanced stages—many of the 200,000 patients we’ll serve this year won’t know they have CKD before our in-home care teams begin treating and educating them about their health.\n\nCKD rarely exists in isolation. Most patients also face conditions like heart failure, diabetes, and hypertension—chronic issues that accelerate kidney disease progression. Monogram is the only provider uniquely positioned to holistically treat both kidney disease and the conditions that cause it, offering a multispecialty, in-home approach that addresses the whole patient. By treating these underlying causes, we’re not",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7302339370928295937",
        "content": "At Monogram Health, our patients are at the heart of everything we do. Our value-based, patient-centered care model goes beyond treating chronic conditions—it transforms lives by delivering measurable improvements in health, well-being, and quality of life.\n\nSee how personalized, multispecialty in-home care made all the difference for Mr. Willie Jackson. Watch his story and discover the impact of Monogram’s approach: https://lnkd.in/eZyKVAkc\n\n#PatientFirst #ValueBasedCare #ChronicCare #HealthcareInnovation",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7300163887067213824",
        "content": "Redefining Kidney Care: Bringing Home Dialysis to Patients Nationwide\n\nAt Monogram Health, we’re transforming kidney care by making home dialysis a safe, effective, and accessible option for patients across the country. Our in-home, specialist-driven approach not only offers greater comfort and convenience but also leads to better health outcomes and an improved quality of life.\n\nUnlike traditional providers, we’re dialysis center agnostic—meaning our recommendations are based solely on what’s best for each patient, not tied to specific facilities. Whether it’s in-center dialysis or home-based treatment, we develop personalized care plans tailored to each patient’s unique health needs and lifestyle.\n\nWe’ve scaled this innovative model nationwide, delivering consistent, evidence-based care ",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7298340647005007874",
        "content": "Chronic Kidney Disease (CKD) disproportionately affects underserved communities—and Monogram Health is committed to closing that gap.\n\nMore than 85% of the communities we serve are below the median household income, and 55% of our patients identify as racial and ethnic minorities. These disparities aren’t just numbers—they reflect real barriers to care that lead to worse outcomes and higher costs.\n\nAt Monogram, we deliver high-quality, in-home care to those who need it most, addressing not just medical conditions but the social determinants of health that often go untreated. By creating access in rural areas and underserved neighborhoods through in home provider visits, we’re not only reducing hospitalizations and lowering costs, but also transforming lives through patient-centered care th",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7297697169371811840",
        "content": "Monogram Health Co-Hosts Exclusive ViVE 2025 Reception with Frist Cressey Ventures \n\nLast night, we had an incredible time co-hosting a reception with Frist Cressey Ventures at Rippy's Honky Tonk in downtown Nashville! It was amazing to connect with over 300 ViVE attendees—from C-suite executives and digital health leaders to innovative startups and investors—all passionate about transforming the future of healthcare.\n\nAs ViVE continues to be a leading forum for the exploration of innovation in digital health, Monogram Health is proud to be part of the conversation, sharing how our in-home, multispecialty care model is reshaping care for patients with complex chronic conditions.\n\nThanks to everyone who joined us for great conversations, good food, and some true Nashville vibes! We’re energ",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7297264747874246658",
        "content": "The Cardio-Kidney Connection: Why a Multispecialty Approach Matters\n\nPatients with chronic kidney disease (CKD) and cardiovascular disease (CVD) face a staggering 58-71% mortality rate—more than double that of patients with normal kidney function.\n\nAt Monogram Health, we recognize this critical link. Over 90% of our patients with CKD also live with cardiac conditions, highlighting the need for a comprehensive, multispecialty approach. Our in-home, provider-based care model addresses not just kidney disease, but also the cardiovascular and metabolic conditions that cause it.\n\nThis approach was front and center at our 2025 annual Clinical Advisory Board meeting, where we explored how our polychronic care model is transforming outcomes for patients with Cardio-Kidney Metabolic Syndrome. By tr",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7295819196997791744",
        "content": "Expanding Access to In-Home Kidney Care for Humana Medicare Advantage Members\n\nMonogram Health is pleased to announce a significant expansion with Humana, extending member access to in-home treatment for kidney disease and its underlying causes. Eligible Humana Medicare Advantage members in Alabama, Louisiana, Mississippi, Tennessee, and now Georgia with chronic kidney disease (CKD) and end-stage kidney disease (ESKD) will have access to Monogram’s evidence-based nephrology and multispecialty value-based care in the comfort of their homes.\n\nChronic kidney disease affects approximately 37 million Americans, many of whom also struggle with multiple chronic conditions like diabetes, high blood pressure, and heart disease. A majority of CKD patients have never seen a nephrologist, revealing a ",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7290726708712751104",
        "content": "Many patients with chronic kidney disease also struggle with heart conditions and other interrelated health challenges. At Monogram Health, we take a multispecialty approach, bringing evidence-based, specialist care directly into patients’ homes to address these complex needs holistically.\n \nFor patients like Mr. Jackson, this approach was transformative. Through personalized in-home care, Monogram treated his heart condition, slowed the progression of his kidney disease, and improved his overall quality of life.\n \nLearn more about Monogram’s care model and how it improved Mr. Jackson’s life: https://lnkd.in/eZyKVAkc\n \n#ValueBasedCare #PatientCare #ChronicConditions #CKD #HealthcareInnovation",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7285320679812407297",
        "content": "Monogram’s CEO Mike Uchrin and CFO Bhavesh Shah are in San Francisco this week for #JPM2025. We’re excited to have the opportunity to share more about the power of our unique in-home multispecialty platform and our track record of success around both cost savings and patient outcomes.\n\n#valuebasedcare #healthcare",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7279507781311746048",
        "content": "Monogram will be attending J.P. Morgan Healthcare 2025. Our CEO Mike Uchrin will speak on Monday, January 13, where he’ll share more with investors about Monogram’s value-based model and our track record of successfully treating patients living with polychronic conditions.\n\n#JPM2025 #Healthcare #ValueBasedCare",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7276955965239816192",
        "content": "This holiday season we are especially grateful for your shared commitment to transforming healthcare for those with polychronic conditions, helping them lead healthier, happier, and more fulfilling lives. \n \nWishing you a joyful holiday season. \n \n#HappyHolidays",
        "date": null,
        "author": "Mike Uchrin"
      },
      {
        "id": "7275559358040584194",
        "content": "Monogram Health is proud to return to J.P. Morgan Healthcare this year with CEO and Co-Founder Mike Uchrin and CFO Bhavesh Shah in attendance. \n \nMike will share the unique value of Monogram’s in-home multispecialty care for patients living with polychronic conditions. His presentation is scheduled for Monday, January 13 at 2 pm PST. \n \nhttps://lnkd.in/dSVzQVCr\n \n#JPM2025 #Healthcare #ValueBasedCare",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7275513969463726080",
        "content": "For many patients, especially those in rural areas, access to specialists can be challenging.\n\nAt Monogram Health, we bring specialist-level care directly into the home—all led by a dedicated Nurse Practitioner.\n\n#AccessToCare #HealthEquity",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7274774086688333824",
        "content": "We’re redefining patient care by integrating actuarial intelligence with evidence-based clinical interventions.\n\nOur proprietary model uses #AI & #analytics to identify at-risk patients and deliver personalized care solutions that improve health outcomes and save money.\n\nAt Monogram, we’re proud to merge actuarial insight with clinical excellence to deliver value-based care like no other.\n\n#ValueBasedCare #PatientCare #DataAnalytics #HealthcareInnovation",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7272241230510448641",
        "content": "Kidney disease care is among the most costly conditions in healthcare, but Monogram Health is changing that.\n\nOur innovative, value-based care model delivers evidence-based, specialized, in-home diagnosis and treatment that reduces emergency visits, hospitalizations, and overall costs.\n\nBy focusing on proactive, comprehensive care, we lower costs while enhancing patient health and quality of life.\n\n#Healthcare #KidneyCare #ValueBasedCare",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7270432990512480257",
        "content": "Health is more than health care—it’s about addressing all the factors impacting our patients’ lives.\n\nWe not only provide evidence-based healthcare, but also support patients to overcome challenges that come along with Social Determinants of Health (SDoH):\n- Transportation\n- Housing\n- Nutrition\n\nWe’re not just treating kidney disease and its causes; we’re empowering patients with the comprehensive support they need to succeed.\n\n#SDoH #HolisticHealthcare #HealthEquity",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7270066846144331776",
        "content": "We’re transforming care for those with chronic kidney disease. Our unique multispecialty care model empowers nurse practitioners to deliver specialist-informed, personalized treatment right where it’s needed most: in the comfort of patients' homes.\n\nBy focusing on polychronic conditions that contribute to kidney disease—metabolic, cardiac, and pulmonary—and end of life care, we’re seeing real patient impact.\n\n#HealthcareInnovation #ValueBasedCare",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7269704445830041600",
        "content": "The Nashville Business Journal recently sat down with our CEO, Mike Uchrin, for a profile that offers a more personal glimpse into the leader behind Monogram Health’s mission. Thank you for the opportunity, Nikki Ross.\n\nhttps://lnkd.in/ekh47abC",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7267550441268199424",
        "content": "This Thanksgiving, we’re grateful for everyone in the Monogram Health family – our dedicated clinicians and staff, trusted partners, and resilient patients.\n\nThank you for inspiring us and working alongside us to transform kidney care. Together, we’re creating brighter health outcomes and a stronger community.\n\n#Thanksgiving #Grateful #HealthcareHeroes",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7262819191152414721",
        "content": "When natural disasters strike, patients with serious conditions like kidney disease and diabetes are especially vulnerable. Monogram’s Emergency Preparedness Program (EPP) is dedicated to providing critical support and continuity of care during these challenging times.\n\nWhen Hurricane Beryl hit, Yolanda faced disrupted dialysis access and power outages. Within 24 hours, Monogram secured her alternative dialysis care and provided ongoing support until her regular dialysis center reopened.\n\n𝗛𝗼𝘄 𝗘𝗣𝗣 𝗠𝗮𝗸𝗲𝘀 𝗮 𝗗𝗶𝗳𝗳𝗲𝗿𝗲𝗻𝗰𝗲:\n• Proactive Outreach – We contact patients directly to check on their well-being and assess immediate needs.\n• Prioritizing At-Risk Patients – Patients needing life-saving treatments, like dialysis, receive our immediate focus or medications, like insulin, that are required to ",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7262109473702305792",
        "content": "The future of healthcare is value-based, and Monogram Health is leading the way. By focusing on outcomes—reducing hospital readmissions, improving quality of life, and delivering care directly in patients’ homes—we’re proving that better care doesn’t have to cost more.\n\n#ValueBasedCare #HealthcareInnovation #PatientOutcomes",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7261735676348370944",
        "content": "Today, we express our deepest gratitude to veterans across the nation for their service, dedication, and sacrifice. At Monogram Health, we are committed to supporting the health and well-being of those who have given so much to our country.\n\nA special thanks to our own CFO, Bhavesh Shah and others within our organization who served in the military and for their dedication to initiatives that ensure quality healthcare access and support for veterans.\n\nTo all veterans: thank you for your service. We honor you today and every day.\n\n#VeteransDay #ThankYouVeterans",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7260656071269134337",
        "content": "At Monogram Health, we believe that better outcomes start with evidence. By grounding our care in clinically proven protocols, rooted in clinical research, we provide the highest quality in-home nephrology and treatment of related chronic diseases that leads to materially better health outcomes for our patients.\n \nFrom reducing hospital readmissions to improving patient quality of life, our evidence-based approach allows us to address the unique needs of individuals with chronic kidney disease and related metabolic and pulmonary conditions. We're not just treating symptoms — we’re transforming lives by focusing on our patients and directly treating all of the chronic conditions they suffer from.\n \n#EvidenceBasedCare #ValueBasedCare #PatientOutcomes #ChronicKidneyDisease #HealthcareInnovati",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7259923740463919104",
        "content": "Congratulations to our CEO, Mike Uchrin, on being named to the Nashville Business Journal's 2024 Power 100 list of Disruptors. Mike’s commitment to advancing care for individuals with kidney disease and complex chronic conditions continues to drive meaningful change in healthcare, making a lasting impact on both the communities we serve across 36 states and the industry. #HealthcareInnovation\n\nhttps://lnkd.in/ewdwcZ4a",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7259616324127985665",
        "content": "Wishing everyone a season of wellness and joy. #Diwali #PatientCare",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7257817135286992896",
        "content": "Last week, we had the privilege of attending American Society of Nephrology's #KidneyWeek. Engaging with leading minds in nephrology and exploring the latest advancements in kidney care energizes our commitment to providing innovative, in-home polychronic care for those with chronic kidney disease. Thank you to everyone who connected with us - we’re inspired by the progress and passion shared by all. #ASN #KidneyCare",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7254930315230507009",
        "content": "What an incredible session yesterday discussing the future of home dialysis! Dr. Shaminder Gupta's guidance, along with personal stories from our patient ambassadors, underscored the life-changing potential of bringing dialysis into the home.\n\nMonogram Health is proud to support patients and clinicians alike in advancing kidney care options.",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7254179590783275008",
        "content": "At Monogram Health, we are transforming kidney care with a home-first approach that builds trust and drives better outcomes. By meeting patients where they are—literally—we form stronger, more meaningful connections with both them and their families.\n\nThis personalized care model, championed by our Chief Medical Officer, Dr. Shaminder Gupta, is improving the lives of those with chronic kidney disease (CKD) and end-stage renal disease (ESRD), particularly in underserved and rural communities.\n\nA renowned internist and nephrologist, Dr. Gupta brings his expertise in population health and home-based dialysis to Monogram, enabling us to deliver innovative, in-home treatments that enhance quality of life while reducing healthcare costs. Under his leadership, we’re leading the way in kidney care",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7252036350965604352",
        "content": "Chronic kidney disease doesn’t exist in isolation, and neither should its treatment. At Monogram Health, we take a polychronic approach — managing not just kidney disease, but all related conditions like diabetes and cardiovascular disease.\n\nThis holistic model allows us to deliver comprehensive care that truly improves lives.\n\n#PolychronicCare #HolisticHealth #ValueBasedCare",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7250580883991064576",
        "content": "Monogram’s Aashish Shah was asked to talk at Healthcare Innovation about how our multispecialty provider clinical model is leading innovation in the SDoH space for complex kidney patients.\n\nAcross the 150,000 patients that Monogram cares for nearly 2/3 are people of color and minorities and over 3/4 live below the US median household income level. They overwhelming have limited income and are reliant on government programs like Medicare and Medicaid. Not surprisingly the most common burdens center around housing, food, and transportation insecurity.\n\nEvery month Monogram closes 40% of the SDoH burdens it encounters. We’re proud of the help we provide but there is more to do.\n\nJoining in the panel discussion was KATHERINE LUSK, CEO of Texas Health Services Authority (Statewide HIE) and Mark",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7250535032077864961",
        "content": "🌪 Monogram Health Stands Strong During Hurricane Milton 🌪\n\nWhen Hurricane Milton struck, our team was ready. We reached out to over 22,000 patients in affected areas, making 2,300 calls and sending more than 29,000 texts to ensure their safety and well-being. With doctors on call and 40 dedicated team members working tirelessly, we provided immediate support to 50 patients with urgent needs.\n\nAt Monogram Health, our commitment to patient care goes beyond routine services. We are always prepared to respond to disasters with speed and precision, ensuring our patients receive the support they need when it matters most. Our dedicated team is here, ready to mobilize for any situation that comes our way.\n\n#MonogramHealth #HurricaneMilton #PatientCare #DisasterResponse",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7249900808320729089",
        "content": "As Hurricane Milton approaches, our team at Monogram Health is reaching out to ensure our patients are prepared and supported. We’re calling each of our patients, checking in on their specific needs, and making sure they have everything necessary to stay safe and healthy during the storm.\n \nFor many, this means securing medications and supplies, so we’re working quickly to arrange deliveries and pickups. Our clinical teams are closely monitoring health conditions and are ready to provide guidance or assistance whenever needed. We’re also partnering with patients and caregivers to review emergency plans and provide reassurance that, even in uncertain times, they are not alone.\n \nAt Monogram Health, we believe that true care means being there when and where it matters most. As we brace for H",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7249439554636496896",
        "content": "Yesterday at Nashville Health Care Council #Sessions2024, our CEO Mike Uchrin discussed what’s next in value-based care in a panel with Optum Chief Medical Officer Dan Murrey, MD,MPP and Harmony Cares CEO Matthew Chance. Attendees walked away with knowledge on the future of home health, Monogram’s transformational multispeciality model, and the meaningful results we’ve delivered for patients.\n \n#CKD #ESKD #KidneyHealth #ValueBasedCare #EvidenceBasedCare #InHomeCare #PrimaryCare #SpecialtyCare #PolychronicCare #PolychronicConditions #Polychronic",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7247056514727710720",
        "content": "We’re excited to announce Monogram Health’s continued expansion with a new direct lease for 26,042 square feet of office space in the Hayden Ferry Lakeside II building in Tempe, Arizona! This location supports our growing operations across the western U.S. and enhances our ability to provide in-home, patient-centered care to individuals living with chronic kidney disease and related conditions.\n \nA special thanks to Cushman & Wakefield for helping us secure this strategic space, and to our dedicated Tempe team, which includes management, clinical operations, patient support services, and provider relations teams.\n#HealthcareInnovation #PatientCare #MonogramHealth #TempeExpansion",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7245496168934182913",
        "content": "Our CEO Mike Uchrin recently joined The Pulse Podcast by Wharton Digital Health to share how Monogram Health is transforming the care landscape for chronic kidney disease (CKD) and end-stage kidney disease (ESKD), and related polychronic conditions.\n \nFrom his childhood dreams and the “aha” moment that inspired the founding of Monogram to the latest innovations in kidney care and practical advice for managing kidney health, hear directly from Mike on how we’re improving patient outcomes.\n\n#CKD #ESKD #KidneyHealth #ValueBasedCare #InHomeCare #PolychronicCare",
        "date": null,
        "author": "Monogram Health"
      }
    ],
    "Hiring": [
      {
        "id": "7358889603455459329",
        "content": "Monogram Health is no ordinary provider - we are drastically changing the way care is delivered to patients across the U.S. through a holistic, multispecialty approach to a patient’s health – delivered in the comfort of their own home. Monogram Health employs a robust clinical team of physicians, specialists, nurses, nurse practitioners, social workers, and pharmacists to diagnose and treat health issues, review and prescribe medication, as well as provide guidance, education, and counseling on a patient’s social needs and healthcare options. \n\nIf you’re interested in joining a team that truly puts the patient first, consider joining our growing team at: https://lnkd.in/e-sa2UjC \n\n#WeAreHiring #Careers #MultiSpecialty #DeliveryOfCare #MonogramHealth",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7338245116416958465",
        "content": "The right medication strategy can change everything – especially in value-based care. \n\nIn a recent Medscape feature, Monogram Health’s SVP of Medication Therapy Management, Lydia Nesemann, shared how embedded pharmacy support drives results. \n \n“Hiring a pharmacist to oversee medication therapy management is a feasible model for a value-based organization — and one that can be an immense value-add for patients and providers alike.” \n\nEach of our 30+ markets has a pharmacist who works with a Monogram Health provider to review, prescribe, and refill medication that best meets that patient’s needs. To learn more about how pharmacists and primary care teams can collaborate for better outcomes, visit: https://lnkd.in/gnC57bsi\n\n#ValueBasedCare #MedicationTherapyManagement #Collaboration",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7321563690791575553",
        "content": "Monogram Health’s CEO, Mike Uchrin, participated in a founders dialogue at Frist Cressey Ventures “CEO Sessions” about building and retaining a team, developing the right strategy for a mission-driven company, and the future growth and success of Monogram Health as it continues to grow and scale across the U.S. \n\nIf you’re interested in joining a passionate, fast-paced team, dedicated to keeping patients with polychronic conditions out of the hospital and living their healthiest life, join our team at: https://lnkd.in/e-sa2UjC\n\n#LessonsInLeadership #Recruitment #WeAreHiring #PositivePatientOutcomes",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7289998158313500673",
        "content": "At Monogram Health, we’ve created a system that lets our clinicians focus on what they do best: caring for patients. By building a culture rooted in purpose, we support our team in delivering exceptional care and making a real difference in people’s lives.\n\nThis approach doesn’t just improve outcomes for patients; it also helps us bring in and keep some of the most skilled and compassionate professionals in healthcare. At Monogram, you’re part of something bigger—working together to transform care for those who need it most.\n\nReady to join a team that puts people first? Explore our career opportunities: https://lnkd.in/e-sa2UjC\n\n#HealthcareCareers #PurposeDrivenWork #TransformingCare #HiringNow",
        "date": null,
        "author": "Monogram Health"
      }
    ],
    "Thought Leadership": [
      {
        "id": "7335696840266309634",
        "content": "The CDC reports that chronic disease accounts for nearly 90% of U.S. healthcare spending – and that cost burden continues to grow. At Monogram Health, we are focused on changing that through timely clinical interventions. \n\nOur multispecialty, value-based model is designed to improve quality outcomes and reduce costs for both patients and health plans. In fact, in 2024, Monogram Health reduced hospital admissions by 44% and helped health plans save $261 million in one year. \n\n#ValueBasedCare #PolyChronicDisease #InHomeCare #PositivePatientOutcomes",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7330961337130377217",
        "content": "Monogram Health’s national and regional leadership teams convened in key markets across Louisiana, Mississippi, Alabama, and Georgia last week to meet with our physician market leaders and their clinical teams that deliver care in the homes of our patients each and every day. As part of these meetings, Monogram Health’s physician-led, market-based teams shared clinical insights across their patient populations within their respective regions; deliberated on healthcare operations and efficiencies for in-home, multispecialty care; and rolled out new technology and systems to streamline administrative processes. \n\nAs Monogram Health continues its work to maximize the health of all people with polychronic disease, we are thankful for our dedicated and highly skilled, clinical pods in our centr",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7300888673053519873",
        "content": "We’re wrapping up an inspiring week at the 2025 Monogram Health Clinical Summit!\n\nOver the past three days, our physicians, advanced practice providers, care managers, and clinical leaders gathered in Nashville to sharpen their skills, share insights, and drive continued excellence in patient care. As a leading multispecialty provider, Monogram Health is proud of the high-quality, evidence-based care we deliver to patients with complex chronic conditions across the country.\n\nThis summit is a testament to our ongoing growth and commitment to expanding our clinician network of W-2 employees to meet the rising demand for our services in 2025 and beyond. By investing in our teams, we’re ensuring that our care model remains scalable, consistent, and impactful—improving outcomes and transforming",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7295079185503461376",
        "content": "Inside Monogram’s Model: How We’re Transforming Complex Care Delivery \n\nLast week, we had the privilege of hosting several of our health plan partners for a client symposium that offered an inside look at how Monogram Health is transforming care for patients with multiple chronic conditions. From patient engagement to evidence-based clinical guidelines, medication therapy management, and actuarial insights, our teams demonstrated how we’re redefining in-home, multispecialty care delivery. \n\nFor the highlight of the visit our partners joined Monogram clinicians on patient visit ride-alongs, seeing firsthand how our providers deliver personalized care directly in patients’ homes. These experiences sparked valuable conversations about the power of proactive, patient-centered care and treatmen",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7293293343856361473",
        "content": "Advancing Clinical Excellence: Monogram’s 5th Clinical Advisory Board Meeting\n\nThis week, we wrapped up Monogram's 5th Clinical Advisory Board meeting, reinforcing our commitment to high-quality, evidence-based care for patients with chronic kidney disease and related polychronic conditions.\n\nComposed of more than 30 leading physicians who are experts in their respective fields and innovators in the industry, our Clinical Advisory Board plays a vital role in advancing Monogram’s physician- and NP-led, in-home multispecialty care model. Their insights help strengthen our approach to patient care and ensure we continue to evolve and refine our evidence-based clinical protocols and order sets.\n\nWe are grateful for the dedication and support of such renowned physicians, whose leadership helps ",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7293047283841990659",
        "content": "Live from Tempe, AZ: A Behind-the-Scenes Look at Monogram’s Transformative Care Model\n \nToday at Monogram’s West Coast Operations Hub, we hosted several of our health plan partners for an in-depth look at how our in-home, multispecialty care model is driving better outcomes for patients with multiple chronic conditions. From seeing our patient engagement and clinical care teams in action to deep dives into our evidence-based clinical guidelines, medication therapy management, and actuarial insights, we explored the many ways Monogram is redefining care delivery.\n \nTomorrow, we take it a step further with patient visit ride-alongs, where our partners will observe firsthand how Monogram providers render personalized in-home care that meets patients where they are.\n \n#ValueBasedCare #PatientC",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7245176018716516355",
        "content": "Ideas flowed and solutions emerged at today’s CAQH Connect 2024's conference opening keynote panel session, “Doctor’s Orders: Fix Provider Systems,” where #MonogramHealth Chief Growth Officer Aashish Shah, HiLabs CEO Amit Garg, American Medical Association Senior Vice President of Health Solutions Lori Prestesater, Highmark Health Vice President of Provider Data & Reimbursement Operations Jamila Sykes, and CAQH Chief Growth Officer Kristina Rollings confronted the current state of provider data management and shared diverse perspectives to drive meaningful innovation.",
        "date": null,
        "author": "Monogram Health"
      }
    ],
    "Event": [
      {
        "id": "7328079085593632768",
        "content": "Founder and CEO of Monogram Health, Michael Uchrin, spoke on a panel at the JPMorganChase's Nashville Healthcare Summit 2025 alongside @RobbieAllen and @DavidThorpe on “The Future of Specialty Care.” As more Americans (133 million) suffer from one or more chronic conditions (i.e., diabetes, heart disease, kidney disease, cancer, hypertension, COPD, etc.) this conversation could not be more critical. \n\nIf you or a loved one are suffering from polychronic disease, check with your insurance to see if they partner with Monogram Health, which offers value-based, multispecialty, in-home care. \n\n#JPMorganChase #MultiSpecialityCare #PatientOutcomes #ValueBasedCare",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7320461456884305920",
        "content": "Monogram Health’s CEO, Mike Uchrin, presented at Nephron Research LLC's NephronNext 2025 virtual conference this April to discuss the underlying issues with patients living with polychronic conditions, notably chronic kidney and end-stage kidney disease, and a new care model available for this population of complex patients. \n\nAt Monogram Health, we deploy an evidence-based, in-home care delivery model with an array of multispecialty clinical services in one place to transform the way health care is delivered. \n\nMonogram Health Partners with leading health plans and risk-bearing providers to care for patients across 36 states, resulting in better patient outcomes and quality of life while reducing medical costs across the healthcare continuum. \n\n#PopulationHealth #MultiSpecialty #Innovativ",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7282423450743255040",
        "content": "Next week, Monogram CEO and Co-Founder Mike Uchrin and CFO Bhavesh Shah will attend J.P. Morgan’s annual healthcare conference in San Francisco.\n \nMike is speaking on Monday, January 13, where he’ll share more with investors about Monogram's growth and plans for the future.\n \n#JPM2025 #Healthcare #ValueBasedCare",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7259621753314766849",
        "content": "Monogram Health was proud to attend last week’s NCQA Health Innovation Summit in Nashville. As an NCQA-accredited organization in Population Health, Case Management, and Credentialing, we’re excited to connect with healthcare leaders and explore innovations that elevate care quality and impact.\n\n#NCQA #HealthInnovationSummit",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7245069662089084928",
        "content": "#MonogramHealth Chief Growth Officer Aashish Shah, M.D., will explore innovative strategies in addressing social determinants of health with Memorial Hermann Health System Director of Health Management Mital Brahmbhatt, MHA, LMSW, during a special panel event at the Healthcare Innovation Texas Summit on October 10.\n\nIf you’re attending, Dr. Shah looks forward to seeing you there!\n\n#CKD #ESKD #KidneyHealth #ValueBasedCare #EvidenceBasedCare #InHomeCare #PrimaryCare #SpecialtyCare #PolychronicCare #PolychronicConditions #Polychronic #Leadership #Entreperenuership",
        "date": null,
        "author": "Monogram Health"
      }
    ],
    "Financial Update": [
      {
        "id": "7315750365897863169",
        "content": "Last weekend Monogram Health attended the Renal Physicians Association 2025 Annual Meeting to connect with nephrologists and discuss how Monogram Health’s in-home specialty model helps extend their practice’s care and treatment for their patients. For these Nephrology practices, Monogram delivers:\n\n-  Reduced hospitalizations & ER visits\n-  Improved care plan adherence & optimized dialysis starts\n-  Increased value-based revenue\n-  Real-time updates for patients and practices alike\n\nWe look forward to continuing these conversations and partnering to improve outcomes for patients with chronic kidney disease.\n\n#RPACommunity #Nephrology #KidneyCare #ValueBasedCare",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7287551522807140352",
        "content": "An announcement about the growth and expansion I talked about last week. First of several. #monogram #monogramhealth #CKD #ESKD #multispecialty #polychronic #provider #providerled #inhome #fullrisk #growth #expansion",
        "date": null,
        "author": "Monogram Health"
      },
      {
        "id": "7254896957226115072",
        "content": "Listen in as GrowthCap's RJ Lumba and our CEO Mike Uchrin talk about how Monogram is transforming care for patients with chronic kidney disease and other complex conditions through our in-home, provider-led multispecialty model.\n\n#multispecialty #polychronic #CKD #ESKD",
        "date": null,
        "author": "Monogram Health"
      }
    ],
    "Product Launch": [],
    "CSR / Social Impact": []
  },
  "jobs": [
    {
      "id": "4293139813",
      "title": "Market Manager - Georgia",
      "url": "https://www.linkedin.com/jobs/view/4293139813/",
      "description": "Job Details\n\nDescription\n\nPosition: Market Manager\n\nThe role of the Market Manager is key to operational performance and market outcomes. The Market Manager will be responsible for the day-to-day operations of the Market. In collaboration with the Market Physician Executive, the Market Manage will oversee all aspects of the people, process and systems that support the delivery of care, growth, and talent for the Market. Through delegated responsibility the Market Manager will be responsible for ",
      "location": "Georgia, United States",
      "employmentType": "full_time",
      "salary": {
        "text": null,
        "min": null,
        "max": null
      }
    },
    {
      "id": "4293668181",
      "title": "Care Manager - Social Worker",
      "url": "https://www.linkedin.com/jobs/view/4293668181/",
      "description": "Job Details\n\nDescription\n\nJob Description: Care Manager, Social Worker\n\nMonogram Health is looking for skilled Social Worker eager for the opportunity to make a difference in patients' lives. The Care Manager Social Worker is a key member of an integrated Care Team which includes a Nurse Care Manager and an Advanced Practice Provider. The patients we serve often struggle with multiple serious diseases and behavioral health challenges. Social workers can remove the many economic and behavioral ba",
      "location": "Mesa, AZ",
      "employmentType": "full_time",
      "salary": {
        "text": null,
        "min": null,
        "max": null
      }
    },
    {
      "id": "4294716810",
      "title": "Care Manager - Registered Nurse",
      "url": "https://www.linkedin.com/jobs/view/4294716810/",
      "description": "Job Details\n\nDescription\n\nJob Description: Care Manager – Registered Nurse\n\nMonogram Health is looking for skilled Registered Nurse eager for the opportunity to make a difference in patients' lives. The Care Manager RN is a key member of an integrated Care Team which includes an Advanced Practice Provider and a Social Worker. The patients we serve often struggle with multiple serious diseases. Registered Nurses help patients improve their quality of life in the home and slow the progression of k",
      "location": "Jacksonville Beach, FL",
      "employmentType": "full_time",
      "salary": {
        "text": null,
        "min": null,
        "max": null
      }
    },
    {
      "id": "4294723686",
      "title": "Care Manager - Registered Nurse",
      "url": "https://www.linkedin.com/jobs/view/4294723686/",
      "description": "Job Details\n\nDescription\n\nJob Description: Care Manager – Registered Nurse\n\nMonogram Health is looking for skilled Registered Nurse eager for the opportunity to make a difference in patients' lives. The Care Manager RN is a key member of an integrated Care Team which includes an Advanced Practice Provider and a Social Worker. The patients we serve often struggle with multiple serious diseases. Registered Nurses help patients improve their quality of life in the home and slow the progression of k",
      "location": "The Villages, FL",
      "employmentType": "full_time",
      "salary": {
        "text": null,
        "min": null,
        "max": null
      }
    },
    {
      "id": "4293140815",
      "title": "Travel Nurse Practitioner",
      "url": "https://www.linkedin.com/jobs/view/4293140815/",
      "description": "Job Details\n\nDescription\n\nPosition: Travel Nurse Practitioner\n\nMonogram Health is looking for a skilled Nurse Practitioner eager for the opportunity to make a difference in patients’ lives. The Monogram Travel Nurse Practitioner plays a critical role in providing access to comprehensive care for underserved patients our Monogram Health network reach. Also, helping patients improve their quality of life in the home and slow the progression of kidney disease and multiple other chronic illnesses, e",
      "location": "Seattle, WA",
      "employmentType": "full_time",
      "salary": {
        "text": null,
        "min": null,
        "max": null
      }
    },
    {
      "id": "4291149586",
      "title": "Field Sales Representative- Everett, PA",
      "url": "https://www.linkedin.com/jobs/view/4291149586/",
      "description": "Job Details\n\nDescription\n\nPosition: Field Sales Representative - Everett, PA\n\nAt Monogram Health, we are transforming care for high-risk patients with multiple chronic conditions, and as a Field Sales Representative, you are at the heart of that mission. In this role, you will engage face-to-face with Monogram-eligible patients who could benefit from our services but are not currently enrolled in our program. By educating patients on Monogram, answering their questions, and building their trust,",
      "location": "Everett, PA",
      "employmentType": "full_time",
      "salary": {
        "text": "70,000 - 90,000 USD",
        "min": 70000,
        "max": 90000,
        "currency": "USD",
        "payPeriod": "YEARLY",
        "compensationType": "BASE_SALARY",
        "compensationSource": "EXTRACTED_FROM_JOB_DESCRIPTION",
        "providedByEmployer": true
      }
    },
    {
      "id": "4294714759",
      "title": "Bilingual Nurse Practitioner",
      "url": "https://www.linkedin.com/jobs/view/4294714759/",
      "description": "Job Details\n\nDescription\n\nJob Description: Nurse Practitioner\n\nMonogram Health is looking for skilled Nurse Practitioners and Physician Assistants eager for the opportunity to make a difference in patients' lives. The Advanced Practitioner at Monogram Health is a key member of an integrated Care Team which includes a Registered Nurse and a Social Worker. The patients we serve often struggle with multiple serious diseases. Our Nurse Practitioners and Physician Assistants help patients improve the",
      "location": "Miami, FL",
      "employmentType": "full_time",
      "salary": {
        "text": null,
        "min": null,
        "max": null
      }
    },
    {
      "id": "4302916529",
      "title": "Service Desk Team Lead",
      "url": "https://www.linkedin.com/jobs/view/4302916529/",
      "description": "Job Details\n\nDescription\n\nPosition: Service Desk Team Lead\n\nThe Service Desk Team Lead is responsible for overseeing the daily operations of the Service Desk, ensuring timely and effective resolution of technical issues, and providing exceptional customer support. This role combines leadership, process management, and hands-on technical expertise to drive service excellence and continuous improvement.\n\nResponsibilities\n\nTeam Leadership & Management\n\nSupervise, mentor, and support a team of Servi",
      "location": "Brentwood, TN",
      "employmentType": "full_time",
      "salary": {
        "text": null,
        "min": null,
        "max": null
      }
    },
    {
      "id": "4294721738",
      "title": "Care Manager - Registered Nurse",
      "url": "https://www.linkedin.com/jobs/view/4294721738/",
      "description": "Job Details\n\nDescription\n\nJob Description: Care Manager – Registered Nurse\n\nMonogram Health is looking for skilled Registered Nurse eager for the opportunity to make a difference in patients' lives. The Care Manager RN is a key member of an integrated Care Team which includes an Advanced Practice Provider and a Social Worker. The patients we serve often struggle with multiple serious diseases. Registered Nurses help patients improve their quality of life in the home and slow the progression of k",
      "location": "Temple Terrace, FL",
      "employmentType": "full_time",
      "salary": {
        "text": null,
        "min": null,
        "max": null
      }
    },
    {
      "id": "4294716809",
      "title": "Nurse Practitioner",
      "url": "https://www.linkedin.com/jobs/view/4294716809/",
      "description": "Job Details\n\nDescription\n\nJob Description: Nurse Practitioner\n\nMonogram Health is looking for skilled Nurse Practitioners and Physician Assistants eager for the opportunity to make a difference in patients' lives. The Advanced Practitioner at Monogram Health is a key member of an integrated Care Team which includes a Registered Nurse and a Social Worker. The patients we serve often struggle with multiple serious diseases. Our Nurse Practitioners and Physician Assistants help patients improve the",
      "location": "Orlando, FL",
      "employmentType": "full_time",
      "salary": {
        "text": null,
        "min": null,
        "max": null
      }
    },
    {
      "id": "4293676022",
      "title": "Care Manager - Registered Nurse",
      "url": "https://www.linkedin.com/jobs/view/4293676022/",
      "description": "Job Details\n\nDescription\n\nJob Description: Care Manager – Registered Nurse\n\nMonogram Health is looking for skilled Registered Nurse eager for the opportunity to make a difference in patients' lives. The Care Manager RN is a key member of an integrated Care Team which includes an Advanced Practice Provider and a Social Worker. The patients we serve often struggle with multiple serious diseases. Registered Nurses help patients improve their quality of life in the home and slow the progression of k",
      "location": "Beckley, WV",
      "employmentType": "full_time",
      "salary": {
        "text": null,
        "min": null,
        "max": null
      }
    },
    {
      "id": "4294720704",
      "title": "Field Sales Representative- Atlanta, GA",
      "url": "https://www.linkedin.com/jobs/view/4294720704/",
      "description": "Job Details\n\nDescription\n\nPosition: Field Sales Representative - Atlanta, GA\n\nAt Monogram Health, we are transforming care for high-risk patients with multiple chronic conditions, and as a Field Sales Representative, you are at the heart of that mission. In this role, you will engage face-to-face with Monogram-eligible patients who could benefit from our services but are not currently enrolled in our program. By educating patients on Monogram, answering their questions, and building their trust,",
      "location": "Atlanta, GA",
      "employmentType": "full_time",
      "salary": {
        "text": null,
        "min": null,
        "max": null
      }
    },
    {
      "id": "4294401359",
      "title": "Patient Experience Coordinator -Bilingual (Spanish)",
      "url": "https://www.linkedin.com/jobs/view/4294401359/",
      "description": "Job Details\n\nDescription\n\nPosition: Patient Experience Coordinator - Bilingual (Spanish)\n\nAs a key team member, the Patient Experience Coordinator outreaches patients by phone to gather feedback on their experience through our patient satisfaction survey.\n\nRoles And Responsibilities\n\n Use friendly, personable scripts to reach out via outbound calls, gathering valuable feedback through satisfaction surveys.Ensure accurate data entry for mailed surveys and efficiently process incoming surveys and ",
      "location": "Brentwood, TN",
      "employmentType": "full_time",
      "salary": {
        "text": null,
        "min": null,
        "max": null
      }
    },
    {
      "id": "4293669216",
      "title": "Nurse Practitioner",
      "url": "https://www.linkedin.com/jobs/view/4293669216/",
      "description": "Job Details\n\nDescription\n\nJob Description: Nurse Practitioner\n\nMonogram Health is looking for skilled Nurse Practitioners and Physician Assistants eager for the opportunity to make a difference in patients' lives. The Advanced Practitioner at Monogram Health is a key member of an integrated Care Team which includes a Registered Nurse and a Social Worker. The patients we serve often struggle with multiple serious diseases. Our Nurse Practitioners and Physician Assistants help patients improve the",
      "location": "Benbrook, TX",
      "employmentType": "full_time",
      "salary": {
        "text": null,
        "min": null,
        "max": null
      }
    },
    {
      "id": "4294721737",
      "title": "Nurse Practitioner",
      "url": "https://www.linkedin.com/jobs/view/4294721737/",
      "description": "Job Details\n\nDescription\n\nJob Description: Nurse Practitioner\n\nMonogram Health is looking for skilled Nurse Practitioners and Physician Assistants eager for the opportunity to make a difference in patients' lives. The Advanced Practitioner at Monogram Health is a key member of an integrated Care Team which includes a Registered Nurse and a Social Worker. The patients we serve often struggle with multiple serious diseases. Our Nurse Practitioners and Physician Assistants help patients improve the",
      "location": "Temple Terrace, FL",
      "employmentType": "full_time",
      "salary": {
        "text": null,
        "min": null,
        "max": null
      }
    },
    {
      "id": "4291149620",
      "title": "Field Sales Representative- Allentown, PA",
      "url": "https://www.linkedin.com/jobs/view/4291149620/",
      "description": "Job Details\n\nDescription\n\nPosition: Field Sales Representative - Allentown, PA\n\nAt Monogram Health, we are transforming care for high-risk patients with multiple chronic conditions, and as a Field Sales Representative, you are at the heart of that mission. In this role, you will engage face-to-face with Monogram-eligible patients who could benefit from our services but are not currently enrolled in our program. By educating patients on Monogram, answering their questions, and building their trus",
      "location": "Allentown, PA",
      "employmentType": "full_time",
      "salary": {
        "text": null,
        "min": null,
        "max": null
      }
    },
    {
      "id": "4291412229",
      "title": "Call Center Representative",
      "url": "https://www.linkedin.com/jobs/view/4291412229/",
      "description": "Job Details\n\nDescription\n\nPosition: Call Center Representative\n\nThe Engagement Specialist is the first Monogram Health voice the patient meets. The Engagement Specialist is responsible for reaching out to patients over the phone to begin the process of educating them about existing benefits of their healthcare plan and encouraging and facilitating their enrollment into our program. The Patient Care Center is open and staffed seven (7) days per week between the core business hours of 8:00am to 7:",
      "location": "Brentwood, TN",
      "employmentType": "full_time",
      "salary": {
        "text": null,
        "min": null,
        "max": null
      }
    },
    {
      "id": "4294711789",
      "title": "Care Manager - Social Worker",
      "url": "https://www.linkedin.com/jobs/view/4294711789/",
      "description": "Job Details\n\nDescription\n\nJob Description: Care Manager, Social Worker\n\nMonogram Health is looking for skilled Social Worker eager for the opportunity to make a difference in patients' lives. The Care Manager Social Worker is a key member of an integrated Care Team which includes a Nurse Care Manager and an Advanced Practice Provider. The patients we serve often struggle with multiple serious diseases and behavioral health challenges. Social workers can remove the many economic and behavioral ba",
      "location": "Miami, FL",
      "employmentType": "full_time",
      "salary": {
        "text": null,
        "min": null,
        "max": null
      }
    },
    {
      "id": "4294713853",
      "title": "Bilingual Care Manager - Registered Nurse",
      "url": "https://www.linkedin.com/jobs/view/4294713853/",
      "description": "Job Details\n\nDescription\n\nPosition: Care Manager – Registered Nurse\n\nMonogram Health is looking for skilled Registered Nurse eager for the opportunity to make a difference in patients' lives. The Care Manager RN is a key member of an integrated Care Team which includes an Advanced Practice Provider and a Social Worker. The patients we serve often struggle with multiple serious diseases. Registered Nurses help patients improve their quality of life in the home and slow the progression of kidney d",
      "location": "Miami, FL",
      "employmentType": "full_time",
      "salary": {
        "text": null,
        "min": null,
        "max": null
      }
    },
    {
      "id": "4294722684",
      "title": "Nurse Practitioner",
      "url": "https://www.linkedin.com/jobs/view/4294722684/",
      "description": "Job Details\n\nDescription\n\nJob Description: Nurse Practitioner\n\nMonogram Health is looking for skilled Nurse Practitioners and Physician Assistants eager for the opportunity to make a difference in patients' lives. The Advanced Practitioner at Monogram Health is a key member of an integrated Care Team which includes a Registered Nurse and a Social Worker. The patients we serve often struggle with multiple serious diseases. Our Nurse Practitioners and Physician Assistants help patients improve the",
      "location": "The Villages, FL",
      "employmentType": "full_time",
      "salary": {
        "text": null,
        "min": null,
        "max": null
      }
    },
    {
      "id": "4293143814",
      "title": "Market Manager - Nashville, TN",
      "url": "https://www.linkedin.com/jobs/view/4293143814/",
      "description": "Job Details\n\nDescription\n\nPosition: Market Manager\n\nThe role of the Market Manager is key to operational performance and market outcomes. The Market Manager will be responsible for the day-to-day operations of the Market. In collaboration with the Market Physician Executive, the Market Manage will oversee all aspects of the people, process and systems that support the delivery of care, growth, and talent for the Market. Through delegated responsibility the Market Manager will be responsible for ",
      "location": "Nashville, TN",
      "employmentType": "full_time",
      "salary": {
        "text": null,
        "min": null,
        "max": null
      }
    },
    {
      "id": "4294709990",
      "title": "Care Manager - Registered Nurse",
      "url": "https://www.linkedin.com/jobs/view/4294709990/",
      "description": "Job Details\n\nDescription\n\nJob Description: Care Manager – Registered Nurse\n\nMonogram Health is looking for skilled Registered Nurse eager for the opportunity to make a difference in patients' lives. The Care Manager RN is a key member of an integrated Care Team which includes an Advanced Practice Provider and a Social Worker. The patients we serve often struggle with multiple serious diseases. Registered Nurses help patients improve their quality of life in the home and slow the progression of k",
      "location": "Orlando, FL",
      "employmentType": "full_time",
      "salary": {
        "text": null,
        "min": null,
        "max": null
      }
    },
    {
      "id": "4293664919",
      "title": "Nurse Practitioner - Morgantown, WV-$5,000 Sign on Bonus",
      "url": "https://www.linkedin.com/jobs/view/4293664919/",
      "description": "Job Details\n\nDescription\n\nJob Description: Nurse Practitioner\n\nMonogram Health is looking for skilled Nurse Practitioners and Physician Assistants eager for the opportunity to make a difference in patients' lives. The Advanced Practitioner at Monogram Health is a key member of an integrated Care Team which includes a Registered Nurse and a Social Worker. The patients we serve often struggle with multiple serious diseases. Our Nurse Practitioners and Physician Assistants help patients improve the",
      "location": "Morgantown, WV",
      "employmentType": "full_time",
      "salary": {
        "text": null,
        "min": null,
        "max": null
      }
    },
    {
      "id": "4294714760",
      "title": "Nurse Practitioner",
      "url": "https://www.linkedin.com/jobs/view/4294714760/",
      "description": "Job Details\n\nDescription\n\nJob Description: Nurse Practitioner\n\nMonogram Health is looking for skilled Nurse Practitioners and Physician Assistants eager for the opportunity to make a difference in patients' lives. The Advanced Practitioner at Monogram Health is a key member of an integrated Care Team which includes a Registered Nurse and a Social Worker. The patients we serve often struggle with multiple serious diseases. Our Nurse Practitioners and Physician Assistants help patients improve the",
      "location": "Jacksonville Beach, FL",
      "employmentType": "full_time",
      "salary": {
        "text": null,
        "min": null,
        "max": null
      }
    },
    {
      "id": "4293998387",
      "title": "Administrative Coordinator – Scheduling Specialist",
      "url": "https://www.linkedin.com/jobs/view/4293998387/",
      "description": "Job Details\n\nDescription\n\nPosition: Administrative Coordinator – Scheduling Specialist\n\nJob Summary\n\nMonogram Health is seeking a market administration coordinator who will be responsible for managing the strategic scheduling needs for field teammates (APPs, RNs, and SWs). This individual will be accountable for utilizing internal tools to identify strategic scheduling opportunity, calling and scheduling patients, creating optimized calendars for field teammates, and ensuring we schedule high im",
      "location": "Georgia, United States",
      "employmentType": "full_time",
      "salary": {
        "text": null,
        "min": null,
        "max": null
      }
    }
  ]
}